Revit 2024 API
Blend Class
A blend solid or void form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Blend : GenericForm
Visual Basic
Public Class Blend _
	Inherits GenericForm
Visual C++
public ref class Blend : public GenericForm
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Blend
See Also
Blend Members
Autodesk.Revit.DB Namespace